
🏗️ Terraform Plan
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # netbox_available_prefix.domain_ipv6 will be created
  + resource "netbox_available_prefix" "domain_ipv6" {
      + description      = "Supernode IPv6 addresses dev"
      + id               = (known after apply)
      + parent_prefix_id = 97
      + prefix           = (known after apply)
      + prefix_length    = 56
      + status           = "reserved"
    }

  # netbox_prefix.loopback_ipv6 will be created
  + resource "netbox_prefix" "loopback_ipv6" {
      + description = "Supernode IPv6 loopback addresses dev"
      + id          = (known after apply)
      + prefix      = (known after apply)
      + status      = "reserved"
    }

  # module.supernode[0].netbox_available_ip_address.primary_ipv4 will be created
  + resource "netbox_available_ip_address" "primary_ipv4" {
      + description = "Primary Address dev_0"
      + id          = (known after apply)
      + ip_address  = (known after apply)
      + prefix_id   = (known after apply)
      + status      = "active"
    }

  # module.supernode[0].netbox_available_ip_address.primary_ipv6 will be created
  + resource "netbox_available_ip_address" "primary_ipv6" {
      + description = "Primary Address dev_0"
      + id          = (known after apply)
      + ip_address  = (known after apply)
      + prefix_id   = (known after apply)
      + status      = "active"
    }

  # module.supernode[0].netbox_available_prefix.primary_ipv4 will be created
  + resource "netbox_available_prefix" "primary_ipv4" {
      + description      = "Primary Address dev_0"
      + id               = (known after apply)
      + parent_prefix_id = 96
      + prefix           = (known after apply)
      + prefix_length    = 32
      + status           = "active"
    }

  # module.supernode[0].netbox_available_prefix.primary_ipv6 will be created
  + resource "netbox_available_prefix" "primary_ipv6" {
      + description      = "Primary Address dev_0"
      + id               = (known after apply)
      + parent_prefix_id = (known after apply)
      + prefix           = (known after apply)
      + prefix_length    = 128
      + status           = "active"
    }

  # module.supernode[1].netbox_available_ip_address.primary_ipv4 will be created
  + resource "netbox_available_ip_address" "primary_ipv4" {
      + description = "Primary Address dev_1"
      + id          = (known after apply)
      + ip_address  = (known after apply)
      + prefix_id   = (known after apply)
      + status      = "active"
    }

  # module.supernode[1].netbox_available_ip_address.primary_ipv6 will be created
  + resource "netbox_available_ip_address" "primary_ipv6" {
      + description = "Primary Address dev_1"
      + id          = (known after apply)
      + ip_address  = (known after apply)
      + prefix_id   = (known after apply)
      + status      = "active"
    }

  # module.supernode[1].netbox_available_prefix.primary_ipv4 will be created
  + resource "netbox_available_prefix" "primary_ipv4" {
      + description      = "Primary Address dev_1"
      + id               = (known after apply)
      + parent_prefix_id = 96
      + prefix           = (known after apply)
      + prefix_length    = 32
      + status           = "active"
    }

  # module.supernode[1].netbox_available_prefix.primary_ipv6 will be created
  + resource "netbox_available_prefix" "primary_ipv6" {
      + description      = "Primary Address dev_1"
      + id               = (known after apply)
      + parent_prefix_id = (known after apply)
      + prefix           = (known after apply)
      + prefix_length    = 128
      + status           = "active"
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```